<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"901cfa4c994fa7f3bd2956641b537460798e5d77a4242c107381abd02625260f","plan_job_ref":"Job Terraform plan #31 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132738775","plan_out_hash":"78ff1fded8cd364e8590efc729c21221aa857cdacfe7f97dcde004f8976a662a","plan_hash":"ae5843d385954bfba6bc47adbe05ecb244c1dc1491d8ef3fc07759389df1e72a","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be created
+   resource "yandex_function" "receive-video-handler" {
+       created_at        = (known after apply)
+       entrypoint        = "ReceiveVideoHandler.Handler"
+       execution_timeout = "10"
+       folder_id         = (known after apply)
+       id                = (known after apply)
+       image_size        = (known after apply)
+       loggroup_id       = (known after apply)
+       memory            = 128
+       name              = "receive-video-handler"
+       runtime           = "dotnet8"
+       tags              = (known after apply)
+       user_hash         = "10390"
+       version           = (known after apply)

+       content {
+           zip_filename = "./receive-video-handler.zip"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Plan not applied in [Terraform apply #16](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132749031) (Plan has changed)